/*
SQLyog v10.2 
MySQL - 5.0.67-community-nt : Database - nongchang
*********************************************************************
*/

/*!40101 SET NAMES utf8 */;

/*!40101 SET SQL_MODE=''*/;

/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;
CREATE DATABASE /*!32312 IF NOT EXISTS*/`nongchang` /*!40100 DEFAULT CHARACTER SET utf8 */;

USE `nongchang`;

/*Table structure for table `nc_goods` */

DROP TABLE IF EXISTS `nc_goods`;

CREATE TABLE `nc_goods` (
  `goods_id` int(10) unsigned NOT NULL auto_increment COMMENT '商品索引id',
  `goods_name` varchar(100) NOT NULL COMMENT '商品名称',
  `gc_id` int(10) unsigned NOT NULL COMMENT '商品分类id',
  `gc_name` varchar(200) NOT NULL COMMENT '商品分类名称',
  `store_id` int(10) unsigned NOT NULL COMMENT '店铺id',
  `goods_image` varchar(100) NOT NULL COMMENT '商品默认封面图片',
  `goods_image_more` text COMMENT '商品多图',
  `goods_store_price` decimal(10,2) NOT NULL COMMENT '商品店铺价格',
  `goods_store_price_interval` varchar(30) NOT NULL default '' COMMENT '商品价格区间',
  `goods_serial` varchar(50) NOT NULL default '' COMMENT '商品货号',
  `goods_show` tinyint(1) NOT NULL COMMENT '商品上架',
  `goods_click` int(11) NOT NULL default '1' COMMENT '商品浏览数',
  `goods_state` tinyint(1) NOT NULL default '0' COMMENT '商品状态，0开启，1违规下架',
  `goods_commend` tinyint(1) NOT NULL COMMENT '商品推荐',
  `goods_keywords` varchar(255) NOT NULL default '' COMMENT '商品关键字',
  `goods_description` varchar(255) NOT NULL default '' COMMENT '商品描述',
  `goods_body` text NOT NULL COMMENT '商品详细内容',
  `goods_attr` text COMMENT '商品属性',
  `goods_spec` text COMMENT '商品规格',
  `goods_col_img` text COMMENT '颜色自定义图片',
  `city_id` mediumint(8) unsigned default '0' COMMENT '商品所在地(市)',
  `province_id` mediumint(8) unsigned default '0' COMMENT '商品所在地(省)',
  `goods_close_reason` varchar(255) default NULL COMMENT '商品违规下架原因',
  `goods_store_state` tinyint(1) NOT NULL default '0' COMMENT '商品所在店铺状态 0开启 1关闭',
  `commentnum` int(10) unsigned NOT NULL default '0' COMMENT '评论次数',
  `goods_collect` int(10) unsigned NOT NULL default '0' COMMENT '商品收藏数量',
  `assured_score` decimal(4,2) default '0.00' COMMENT '商品放心值',
  `addtime` int(10) unsigned NOT NULL default '0',
  `updatetime` int(10) unsigned NOT NULL default '0',
  PRIMARY KEY  (`goods_id`),
  KEY `store_id` (`store_id`),
  KEY `gc_id` (`gc_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='商品表';

/*Data for the table `nc_goods` */

/*Table structure for table `nc_goods_class` */

DROP TABLE IF EXISTS `nc_goods_class`;

CREATE TABLE `nc_goods_class` (
  `gc_id` int(10) unsigned NOT NULL auto_increment COMMENT '索引ID',
  `gc_name` varchar(100) NOT NULL COMMENT '分类名称',
  `type_id` int(10) unsigned NOT NULL COMMENT '类型id',
  `type_name` varchar(100) NOT NULL COMMENT '类型名称',
  `store_id` int(10) unsigned NOT NULL default '0' COMMENT '店铺ID，0为系统后台发布',
  `gc_parent_id` int(10) unsigned NOT NULL default '0' COMMENT '父ID',
  `gc_sort` tinyint(1) unsigned NOT NULL default '0' COMMENT '排序',
  `gc_show` tinyint(1) NOT NULL default '1' COMMENT '前台显示，0为否，1为是，默认为1',
  `gc_title` varchar(200) NOT NULL COMMENT '名称',
  `gc_keywords` varchar(255) NOT NULL default '' COMMENT '关键词',
  `gc_description` varchar(255) NOT NULL default '' COMMENT '描述',
  PRIMARY KEY  (`gc_id`),
  KEY `store_id` (`store_id`,`gc_parent_id`)
) ENGINE=InnoDB AUTO_INCREMENT=808 DEFAULT CHARSET=utf8 COMMENT='商品分类表';

/*Data for the table `nc_goods_class` */

insert  into `nc_goods_class`(`gc_id`,`gc_name`,`type_id`,`type_name`,`store_id`,`gc_parent_id`,`gc_sort`,`gc_show`,`gc_title`,`gc_keywords`,`gc_description`) values (1,'蔬菜/水果',1,'种植业',0,0,0,1,'','',''),(2,'茶叶',1,'种植业',0,0,0,1,'','',''),(3,'油料作物',1,'种植业',0,0,0,1,'','',''),(4,'糖料作物',1,'种植业',0,0,0,1,'','',''),(5,'细粮',1,'种植业',0,0,0,1,'','',''),(6,'豆成品',5,'加工制品',0,0,1,1,'','',''),(7,'调味品',5,'加工制品',0,0,1,1,'','',''),(8,'纤维作物',1,'种植业',0,0,0,1,'','',''),(9,'方便食品',5,'加工制品',0,0,1,1,'','',''),(10,'罐头',5,'加工制品',0,0,1,1,'','',''),(11,'酒',6,'酒/饮料/蜂蜜',0,0,2,1,'','',''),(12,'新鲜蔬菜/水果',1,'种植业',0,1,1,1,'','',''),(13,'腌制蔬菜',1,'种植业',0,1,255,1,'','',''),(15,'叶菜类',1,'种植业',0,13,255,1,'','',''),(16,'芽苗类',1,'种植业',0,12,255,1,'','',''),(17,'花菜类',1,'种植业',0,12,255,1,'','',''),(18,'果菜类',1,'种植业',0,12,255,1,'','',''),(19,'菌类',1,'种植业',0,12,255,1,'','',''),(20,'瓜类',1,'种植业',0,12,255,1,'','',''),(21,'浆果类',1,'种植业',0,12,255,1,'','',''),(22,'柑橘类',1,'种植业',0,12,255,1,'','',''),(23,'核果类',1,'种植业',0,12,255,1,'','',''),(24,'仁果类',1,'种植业',0,12,255,1,'','',''),(25,'其它果类',1,'种植业',0,12,255,1,'','',''),(28,'根茎类',1,'种植业',0,13,255,1,'','',''),(29,'芽苗类',1,'种植业',0,13,255,1,'','',''),(30,'花菜类',1,'种植业',0,13,255,1,'','',''),(31,'果菜类',1,'种植业',0,13,255,1,'','',''),(32,'菌类',1,'种植业',0,13,255,1,'','',''),(33,'瓜类',1,'种植业',0,13,255,1,'','',''),(34,'其它',1,'种植业',0,13,255,1,'','',''),(37,'保暖内衣',1,'种植业',0,14,255,1,'','',''),(38,'保暖打底裤',1,'种植业',0,14,255,1,'','',''),(39,'秋冬睡衣',1,'种植业',0,14,255,1,'','',''),(40,'珊瑚绒睡衣',1,'种植业',0,14,255,1,'','',''),(41,'塑身内衣',1,'种植业',0,14,255,1,'','',''),(42,'文胸套装',1,'种植业',0,14,255,1,'','',''),(43,'文胸',1,'种植业',0,14,255,1,'','',''),(44,'内裤',1,'种植业',0,14,255,1,'','',''),(45,'袜子',1,'种植业',0,14,255,1,'','',''),(46,'连裤袜',1,'种植业',0,14,255,1,'','',''),(47,'棉袜',1,'种植业',0,14,255,1,'','',''),(48,'肉类罐头',5,'加工制品',0,10,255,1,'','',''),(49,'禽类罐头',5,'加工制品',0,10,255,1,'','',''),(50,'水产品罐头',5,'加工制品',0,10,255,1,'','',''),(51,'清蒸类肉罐头',5,'加工制品',0,48,255,1,'','',''),(52,'调味类肉罐头',5,'加工制品',0,48,255,1,'','',''),(53,'腌制类肉罐头',5,'加工制品',0,48,255,1,'','',''),(54,'烟熏类肉罐头',5,'加工制品',0,48,255,1,'','',''),(55,'香肠类肉罐头',5,'加工制品',0,48,255,1,'','',''),(56,'内脏类肉罐头',5,'加工制品',0,48,255,1,'','',''),(57,'其它',5,'加工制品',0,48,255,1,'','',''),(75,'白烧类禽罐头',5,'加工制品',0,49,255,1,'','',''),(76,'去骨类禽罐头',5,'加工制品',0,49,255,1,'','',''),(77,'调味类禽罐头',5,'加工制品',0,49,255,1,'','',''),(78,'其它',5,'加工制品',0,49,255,1,'','',''),(81,'油浸(熏制)类水产罐头',5,'加工制品',0,50,255,1,'','',''),(82,'调味类水产罐头',5,'加工制品',0,50,255,1,'','',''),(83,'清蒸类水产罐头',5,'加工制品',0,50,255,1,'','',''),(84,'其它',5,'加工制品',0,50,255,1,'','',''),(93,'青茶/乌龙茶',1,'种植业',0,2,255,1,'','',''),(94,'红茶',1,'种植业',0,2,255,1,'','',''),(95,'绿茶',1,'种植业',0,2,255,1,'','',''),(96,'铁观音',1,'种植业',0,93,255,1,'','',''),(97,'黄金桂',1,'种植业',0,93,255,1,'','',''),(98,'武夷岩茶',1,'种植业',0,93,255,1,'','',''),(99,'漳平水仙',1,'种植业',0,93,255,1,'','',''),(100,'漳州黄芽奇兰',1,'种植业',0,93,255,1,'','',''),(101,'永春佛手',1,'种植业',0,93,255,1,'','',''),(102,'台湾冻顶乌龙',1,'种植业',0,93,255,1,'','',''),(103,'广东凤凰水仙',1,'种植业',0,93,255,1,'','',''),(104,'凤凰单枞',1,'种植业',0,93,255,1,'','',''),(105,'其它',1,'种植业',0,93,255,1,'','',''),(106,'正山小种',1,'种植业',0,94,255,1,'','',''),(107,'金骏眉',1,'种植业',0,94,255,1,'','',''),(108,'银骏眉',1,'种植业',0,94,255,1,'','',''),(109,'坦洋工夫',1,'种植业',0,94,255,1,'','',''),(110,'龙井',1,'种植业',0,95,255,1,'','',''),(111,'碧螺春',1,'种植业',0,95,255,1,'','',''),(112,'黄山毛峰',1,'种植业',0,95,255,1,'','',''),(113,'南京雨花茶',1,'种植业',0,95,255,1,'','',''),(114,'信阳毛尖',1,'种植业',0,95,255,1,'','',''),(115,'庐山云雾茶',1,'种植业',0,95,255,1,'','',''),(116,'竹叶青',1,'种植业',0,95,255,1,'','',''),(117,'安吉白茶',1,'种植业',0,95,255,1,'','',''),(118,'雾里青',1,'种植业',0,95,255,1,'','',''),(119,'其它',1,'种植业',0,95,255,1,'','',''),(122,'大豆',1,'种植业',0,3,255,1,'','',''),(123,'花生',1,'种植业',0,3,255,1,'','',''),(124,'芝麻',1,'种植业',0,3,255,1,'','',''),(148,'甘蔗',1,'种植业',0,4,255,1,'','',''),(149,'甜糖菜',1,'种植业',0,4,255,1,'','',''),(150,'其它糖料作物',1,'种植业',0,4,255,1,'','',''),(177,'大米',1,'种植业',0,5,255,1,'','',''),(178,'面粉',1,'种植业',0,5,255,1,'','',''),(179,'米粉',1,'种植业',0,5,255,1,'','',''),(200,'腐竹',5,'加工制品',0,6,255,1,'','',''),(201,'腐乳',5,'加工制品',0,6,255,1,'','',''),(202,'豆浆',5,'加工制品',0,6,255,1,'','',''),(228,'酿造类调味品',5,'加工制品',0,7,255,1,'','',''),(229,'腌菜类调味品',5,'加工制品',0,7,255,1,'','',''),(230,'鲜菜类调味品',5,'加工制品',0,7,255,1,'','',''),(231,'配方奶粉',5,'加工制品',0,228,255,1,'','',''),(232,'羊奶粉',5,'加工制品',0,228,255,1,'','',''),(233,'辅食',5,'加工制品',0,228,255,1,'','',''),(234,'营养品',5,'加工制品',0,228,255,1,'','',''),(235,'榨菜',5,'加工制品',0,229,255,1,'','',''),(236,'芽菜',5,'加工制品',0,229,255,1,'','',''),(237,'冬菜',5,'加工制品',0,229,255,1,'','',''),(238,'梅干菜',5,'加工制品',0,229,255,1,'','',''),(239,'腌雪里蕻',5,'加工制品',0,229,255,1,'','',''),(240,'泡姜',5,'加工制品',0,229,255,1,'','',''),(241,'泡辣椒',5,'加工制品',0,229,255,1,'','',''),(242,'其它',5,'加工制品',0,229,255,1,'','',''),(244,'葱',5,'加工制品',0,230,255,1,'','',''),(245,'蒜',5,'加工制品',0,230,255,1,'','',''),(246,'姜',5,'加工制品',0,230,255,1,'','',''),(247,'辣椒',5,'加工制品',0,230,255,1,'','',''),(248,'芫荽',5,'加工制品',0,230,255,1,'','',''),(249,'辣根',5,'加工制品',0,230,255,1,'','',''),(250,'香椿',5,'加工制品',0,230,255,1,'','',''),(251,'其它',5,'加工制品',0,230,255,1,'','',''),(255,'即食食品',5,'加工制品',0,9,255,1,'','',''),(256,'速冻食品',5,'加工制品',0,9,255,1,'','',''),(257,'干的或粉状方便食品',5,'加工制品',0,9,255,1,'','',''),(258,'糕点',5,'加工制品',0,255,255,1,'','',''),(259,'面包',5,'加工制品',0,255,255,1,'','',''),(260,'馒头',5,'加工制品',0,255,255,1,'','',''),(261,'油饼',5,'加工制品',0,255,255,1,'','',''),(262,'麻花',5,'加工制品',0,255,255,1,'','',''),(263,'汤圆',5,'加工制品',0,255,255,1,'','',''),(264,'饺子',5,'加工制品',0,255,255,1,'','',''),(265,'馄饨',5,'加工制品',0,255,255,1,'','',''),(266,'其它',5,'加工制品',0,255,255,1,'','',''),(271,'水产速冻食品',5,'加工制品',0,256,255,1,'','',''),(272,'农产速冻食品',5,'加工制品',0,256,255,1,'','',''),(273,'畜产速冻食品',5,'加工制品',0,256,255,1,'','',''),(274,'其它',5,'加工制品',0,256,255,1,'','',''),(275,'方便面',5,'加工制品',0,257,255,1,'','',''),(276,'方便米粉',5,'加工制品',0,257,255,1,'','',''),(277,'方便米饭',5,'加工制品',0,257,255,1,'','',''),(278,'方便饮料或调料',5,'加工制品',0,257,255,1,'','',''),(279,'速溶奶粉',5,'加工制品',0,257,255,1,'','',''),(280,'其它',5,'加工制品',0,257,255,1,'','',''),(286,'棉',1,'种植业',0,8,255,1,'','',''),(287,'麻',1,'种植业',0,8,255,1,'','',''),(288,'其它',1,'种植业',0,8,255,1,'','',''),(319,'白酒',6,'酒/饮料/蜂蜜',0,11,255,1,'','',''),(320,'啤酒',6,'酒/饮料/蜂蜜',0,11,255,1,'','',''),(321,'黄酒',6,'酒/饮料/蜂蜜',0,11,255,1,'','',''),(341,'面条',1,'种植业',0,5,255,1,'','',''),(344,'叶菜类',1,'种植业',0,12,0,1,'','',''),(345,'根茎类',1,'种植业',0,12,0,1,'','',''),(346,'中草药',1,'种植业',0,0,0,1,'{sitename}','',''),(350,'粮食作物',1,'种植业',0,0,0,1,'','',''),(351,'饮料',6,'酒/饮料/蜂蜜',0,0,2,1,'','',''),(352,'蜂蜜',6,'酒/饮料/蜂蜜',0,0,2,1,'','',''),(353,'种子种苗',7,'农资产品',0,0,3,1,'','',''),(354,'农药',7,'农资产品',0,0,3,1,'','',''),(355,'肥料',7,'农资产品',0,0,3,1,'','',''),(356,'农机具',7,'农资产品',0,0,3,1,'','',''),(357,'植物油',8,'食用油',0,0,4,1,'','',''),(358,'动物油',8,'食用油',0,0,4,1,'','',''),(359,'肉干/肉脯/豆干/肉类',2,'休闲食品',0,0,5,1,'','',''),(360,'饼干/糕点/膨化小食',2,'休闲食品',0,0,5,1,'','',''),(361,'山核桃/坚果/炒货',2,'休闲食品',0,0,5,1,'','',''),(362,'鱿鱼/鱼干/海味即食',2,'休闲食品',0,0,5,1,'','',''),(363,'糖果',2,'休闲食品',0,0,5,1,'','',''),(364,'蜜饯/枣类/梅/果脯',2,'休闲食品',0,0,5,1,'','',''),(365,'活牲畜',3,'养殖业',0,0,6,1,'','',''),(366,'活家禽',3,'养殖业',0,0,6,1,'','',''),(367,'鲜活水产',3,'养殖业',0,0,6,1,'','',''),(368,'鲜牲畜肉',3,'养殖业',0,0,6,1,'','',''),(369,'鲜家禽肉',3,'养殖业',0,0,6,1,'','',''),(370,'新鲜禽蛋',3,'养殖业',0,0,6,1,'','',''),(371,'咸家禽肉',3,'养殖业',0,0,6,1,'','',''),(372,'咸牲畜肉',3,'养殖业',0,0,6,1,'','',''),(373,'咸家禽蛋',3,'养殖业',0,0,6,1,'','',''),(374,'其它水产品',3,'养殖业',0,0,6,1,'','',''),(375,'畜牧业副产品',3,'养殖业',0,0,6,1,'','',''),(376,'白茶',1,'种植业',0,2,255,1,'','',''),(377,'黑茶',1,'种植业',0,2,255,1,'','',''),(378,'黄茶',1,'种植业',0,2,255,1,'','',''),(379,'其它茶',1,'种植业',0,2,255,1,'','',''),(380,'祁门工夫',1,'种植业',0,94,255,1,'','',''),(381,'宁红',1,'种植业',0,94,255,1,'','',''),(382,'其它',1,'种植业',0,94,255,1,'','',''),(383,'福鼎白茶',1,'种植业',0,376,0,1,'','',''),(384,'白毫银针',1,'种植业',0,376,0,1,'','',''),(385,'白牡丹',1,'种植业',0,376,0,1,'','',''),(386,'贡眉/寿眉',1,'种植业',0,376,0,1,'','',''),(387,'其它',1,'种植业',0,376,0,1,'','',''),(388,'茯砖茶',1,'种植业',0,377,0,1,'','',''),(389,'六堡茶',1,'种植业',0,377,0,1,'','',''),(390,'普洱茶',1,'种植业',0,377,0,1,'','',''),(391,'其它',1,'种植业',0,377,0,1,'','',''),(392,'君山银针',1,'种植业',0,378,0,1,'','',''),(393,'蒙顶黄芽',1,'种植业',0,378,0,1,'','',''),(394,'沩山毛尖',1,'种植业',0,378,0,1,'','',''),(395,'平阳黄汤',1,'种植业',0,378,0,1,'','',''),(396,'其它',1,'种植业',0,378,0,1,'','',''),(397,'向日葵',1,'种植业',0,3,0,1,'','',''),(398,'棉籽',1,'种植业',0,3,0,1,'','',''),(399,'蓖麻',1,'种植业',0,3,0,1,'','',''),(400,'苏子',1,'种植业',0,3,0,1,'','',''),(401,'油用亚麻',1,'种植业',0,3,0,1,'','',''),(402,'大麻',1,'种植业',0,3,0,1,'','',''),(403,'其它',1,'种植业',0,3,0,1,'','',''),(404,'甜菊',1,'种植业',0,4,0,1,'','',''),(405,'麦粉',1,'种植业',0,5,0,1,'','',''),(406,'其它',1,'种植业',0,5,255,1,'','',''),(407,'动物类',1,'种植业',0,346,0,1,'','',''),(408,'植物类',1,'种植业',0,346,0,1,'','',''),(409,'矿物类',1,'种植业',0,346,0,1,'','',''),(410,'菌藻类',1,'种植业',0,346,0,1,'','',''),(411,'其它药类',1,'种植业',0,346,0,1,'','',''),(412,'蝉蜕',1,'种植业',0,407,0,1,'','',''),(413,'蜜蜂',1,'种植业',0,407,0,1,'','',''),(414,'五倍子',1,'种植业',0,407,0,1,'','',''),(415,'地龙',1,'种植业',0,407,0,1,'','',''),(416,'蝎子',1,'种植业',0,407,0,1,'','',''),(417,'蜈蚣',1,'种植业',0,407,0,1,'','',''),(418,'鳖甲',1,'种植业',0,407,0,1,'','',''),(419,'其他动物药材',1,'种植业',0,407,0,1,'','',''),(420,'根茎类',1,'种植业',0,408,0,1,'','',''),(421,'果实籽仁类',1,'种植业',0,408,0,1,'','',''),(422,'全草类',1,'种植业',0,408,0,1,'','',''),(423,'花类',1,'种植业',0,408,0,1,'','',''),(424,'叶类',1,'种植业',0,408,0,1,'','',''),(425,'树皮类',1,'种植业',0,408,0,1,'','',''),(426,'藤木类',1,'种植业',0,408,0,1,'','',''),(427,'树脂类',1,'种植业',0,408,0,1,'','',''),(428,'其它',1,'种植业',0,408,0,1,'','',''),(429,'朱砂',1,'种植业',0,409,0,1,'','',''),(430,'海藻',1,'种植业',0,409,0,1,'','',''),(431,'石胆',1,'种植业',0,409,0,1,'','',''),(432,'矾磁',1,'种植业',0,409,0,1,'','',''),(433,'石赤',1,'种植业',0,409,0,1,'','',''),(434,'石脂',1,'种植业',0,409,0,1,'','',''),(435,'白石英',1,'种植业',0,409,0,1,'','',''),(436,'其它',1,'种植业',0,409,0,1,'','',''),(437,'茯苓',1,'种植业',0,410,0,1,'','',''),(438,'冬虫夏草',1,'种植业',0,410,0,1,'','',''),(439,'茯神',1,'种植业',0,410,0,1,'','',''),(440,'猪苓',1,'种植业',0,410,0,1,'','',''),(441,'海金沙',1,'种植业',0,410,0,1,'','',''),(442,'茯苓皮',1,'种植业',0,410,0,1,'','',''),(443,'海藻',1,'种植业',0,410,0,1,'','',''),(444,'马勃',1,'种植业',0,410,0,1,'','',''),(445,'银耳',1,'种植业',0,410,0,1,'','',''),(446,'其他',1,'种植业',0,410,0,1,'','',''),(447,'禾谷类',1,'种植业',0,350,0,1,'','',''),(448,'薯类',1,'种植业',0,350,0,1,'','',''),(449,'豆菽类',1,'种植业',0,350,0,1,'','',''),(450,'其它杂粮',1,'种植业',0,350,0,1,'','',''),(451,'水稻',1,'种植业',0,447,0,1,'','',''),(452,'玉米',1,'种植业',0,447,0,1,'','',''),(453,'小麦',1,'种植业',0,447,0,1,'','',''),(454,'大麦',1,'种植业',0,447,0,1,'','',''),(455,'燕麦',1,'种植业',0,447,0,1,'','',''),(456,'高粱',1,'种植业',0,447,0,1,'','',''),(457,'粟',1,'种植业',0,447,0,1,'','',''),(458,'黍',1,'种植业',0,447,0,1,'','',''),(459,'荞麦',1,'种植业',0,447,0,1,'','',''),(460,'其它',1,'种植业',0,447,0,1,'','',''),(461,'红薯',1,'种植业',0,448,0,1,'','',''),(462,'白薯',1,'种植业',0,448,0,1,'','',''),(463,'马铃薯',1,'种植业',0,448,0,1,'','',''),(464,'山药',1,'种植业',0,448,0,1,'','',''),(465,'芋',1,'种植业',0,448,0,1,'','',''),(466,'木薯',1,'种植业',0,448,0,1,'','',''),(467,'其它',1,'种植业',0,448,0,1,'','',''),(468,'大豆',1,'种植业',0,449,0,1,'','',''),(469,'蚕豆',1,'种植业',0,449,0,1,'','',''),(470,'豌豆',1,'种植业',0,449,0,1,'','',''),(471,'绿豆',1,'种植业',0,449,0,1,'','',''),(472,'红小豆',1,'种植业',0,449,0,1,'','',''),(473,'芸豆',1,'种植业',0,449,0,1,'','',''),(474,'其它',1,'种植业',0,449,0,1,'','',''),(475,'豆奶',5,'加工制品',0,6,0,1,'','',''),(476,'豆奶粉',5,'加工制品',0,6,0,1,'','',''),(477,'豆腐及制品',5,'加工制品',0,6,0,1,'','',''),(478,'其他豆成品类',5,'加工制品',0,6,0,1,'','',''),(479,'干货类调味品',5,'加工制品',0,7,0,1,'','',''),(480,'水产类调味品',5,'加工制品',0,7,0,1,'','',''),(481,'其它类调味品',5,'加工制品',0,7,0,1,'','',''),(482,'胡椒',5,'加工制品',0,479,0,1,'','',''),(483,'花椒',5,'加工制品',0,479,0,1,'','',''),(484,'干辣椒',5,'加工制品',0,479,0,1,'','',''),(485,'八角',5,'加工制品',0,479,0,1,'','',''),(486,'小茴香',5,'加工制品',0,479,0,1,'','',''),(487,'芥末',5,'加工制品',0,479,0,1,'','',''),(488,'桂皮',5,'加工制品',0,479,0,1,'','',''),(489,'姜片',5,'加工制品',0,479,0,1,'','',''),(490,'姜粉',5,'加工制品',0,479,0,1,'','',''),(491,'草果',6,'酒/饮料/蜂蜜',0,479,0,1,'','',''),(492,'其它',5,'加工制品',0,479,0,1,'','',''),(493,'鱼露',5,'加工制品',0,480,0,1,'','',''),(494,'虾米',5,'加工制品',0,480,0,1,'','',''),(495,'虾皮',5,'加工制品',0,480,0,1,'','',''),(496,'虾籽',5,'加工制品',0,480,0,1,'','',''),(497,'虾酱',5,'加工制品',0,480,0,1,'','',''),(498,'虾油',5,'加工制品',0,480,0,1,'','',''),(499,'蚝油',5,'加工制品',0,480,0,1,'','',''),(500,'蟹制品',5,'加工制品',0,480,0,1,'','',''),(501,'淡菜',5,'加工制品',0,480,0,1,'','',''),(502,'紫菜',5,'加工制品',0,480,0,1,'','',''),(503,'其它',5,'加工制品',0,480,0,1,'','',''),(504,'食盐',5,'加工制品',0,481,0,1,'','',''),(505,'味精',5,'加工制品',0,481,0,1,'','',''),(506,'糖',5,'加工制品',0,481,0,1,'','',''),(507,'黄酒',5,'加工制品',0,481,0,1,'','',''),(508,'咖喱粉',5,'加工制品',0,481,0,1,'','',''),(509,'五香粉',5,'加工制品',0,481,0,1,'','',''),(510,'芝麻油',5,'加工制品',0,481,0,1,'','',''),(511,'芝麻酱',5,'加工制品',0,481,0,1,'','',''),(512,'花生酱',5,'加工制品',0,481,0,1,'','',''),(513,'沙茶酱',5,'加工制品',0,481,0,1,'','',''),(514,'银虾酱',5,'加工制品',0,481,0,1,'','',''),(515,'番茄沙司',5,'加工制品',0,481,0,1,'','',''),(516,'番茄酱',5,'加工制品',0,481,0,1,'','',''),(517,'果酱',5,'加工制品',0,481,0,1,'','',''),(518,'番茄汁',5,'加工制品',0,481,0,1,'','',''),(519,'桂林酱',5,'加工制品',0,481,0,1,'','',''),(520,'椒油辣酱',5,'加工制品',0,481,0,1,'','',''),(521,'芝麻辣酱',5,'加工制品',0,481,0,1,'','',''),(522,'花生辣酱',5,'加工制品',0,481,0,1,'','',''),(523,'油酥酱',5,'加工制品',0,481,0,1,'','',''),(524,'辣酱油',5,'加工制品',0,481,0,1,'','',''),(525,'辣椒油',5,'加工制品',0,481,0,1,'','',''),(526,'香糟',5,'加工制品',0,481,0,1,'','',''),(527,'红糟',5,'加工制品',0,481,0,1,'','',''),(528,'菌油',5,'加工制品',0,481,0,1,'','',''),(529,'其它',5,'加工制品',0,481,0,1,'','',''),(530,'酱油',5,'加工制品',0,228,0,1,'','',''),(531,'食醋',5,'加工制品',0,228,0,1,'','',''),(532,'酱',5,'加工制品',0,228,0,1,'','',''),(533,'豆豉',5,'加工制品',0,228,0,1,'','',''),(534,'豆腐乳',5,'加工制品',0,228,0,1,'','',''),(535,'其它',5,'加工制品',0,228,0,1,'','',''),(536,'方便菜肴',5,'加工制品',0,9,0,1,'','',''),(537,'其它',5,'加工制品',0,9,0,1,'','',''),(538,'水果罐头',5,'加工制品',0,10,0,1,'','',''),(539,'蔬菜罐头',5,'加工制品',0,10,0,1,'','',''),(540,'其它罐头',5,'加工制品',0,10,0,1,'','',''),(541,'糖水类水果罐头',5,'加工制品',0,538,0,1,'','',''),(542,'果酱类水果罐头',5,'加工制品',0,538,0,1,'','',''),(543,'糖浆类水果罐头',5,'加工制品',0,538,0,1,'','',''),(544,'果汁类罐头',5,'加工制品',0,538,0,1,'','',''),(545,'其它',5,'加工制品',0,538,0,1,'','',''),(546,'清渍类蔬菜罐头',5,'加工制品',0,539,0,1,'','',''),(547,'醋渍类蔬菜罐头',5,'加工制品',0,539,0,1,'','',''),(548,'调味类蔬菜罐头',5,'加工制品',0,539,0,1,'','',''),(549,'盐渍(酱渍)蔬菜罐头',5,'加工制品',0,539,0,1,'','',''),(550,'其它',5,'加工制品',0,539,0,1,'','',''),(551,'坚干果类罐头',5,'加工制品',0,540,0,1,'','',''),(552,'汤类罐头',5,'加工制品',0,540,0,1,'','',''),(553,'其它',5,'加工制品',0,540,0,1,'','',''),(554,'果酒',6,'酒/饮料/蜂蜜',0,11,0,1,'','',''),(555,'药酒',6,'酒/饮料/蜂蜜',0,11,0,1,'','',''),(556,'配制酒',6,'酒/饮料/蜂蜜',0,11,0,1,'','',''),(557,'保健酒',6,'酒/饮料/蜂蜜',0,11,0,1,'','',''),(558,'洋酒',6,'酒/饮料/蜂蜜',0,11,0,1,'','',''),(559,'其它',6,'酒/饮料/蜂蜜',0,11,0,1,'','',''),(560,'蛋白类饮料',6,'酒/饮料/蜂蜜',0,351,0,1,'','',''),(561,'碳酸饮料',6,'酒/饮料/蜂蜜',0,351,0,1,'','',''),(562,'果汁和蔬菜汁类',6,'酒/饮料/蜂蜜',0,351,0,1,'','',''),(563,'乳品饮料',6,'酒/饮料/蜂蜜',0,351,0,1,'','',''),(564,'功能饮料',6,'酒/饮料/蜂蜜',0,351,0,1,'','',''),(565,'咖啡饮料',6,'酒/饮料/蜂蜜',0,351,0,1,'','',''),(566,'瓶装饮用水类',6,'酒/饮料/蜂蜜',0,351,0,1,'','',''),(567,'其它',6,'酒/饮料/蜂蜜',0,351,0,1,'','',''),(568,'桔梗蜜',6,'酒/饮料/蜂蜜',0,352,0,1,'','',''),(569,'紫云英蜜',6,'酒/饮料/蜂蜜',0,352,0,1,'','',''),(570,'丹参蜜',6,'酒/饮料/蜂蜜',0,352,0,1,'','',''),(571,'黄连蜜',6,'酒/饮料/蜂蜜',0,352,0,1,'','',''),(572,'黄芪蜜',6,'酒/饮料/蜂蜜',0,352,0,1,'','',''),(573,'茶花蜜',6,'酒/饮料/蜂蜜',0,352,0,1,'','',''),(574,'小茴香蜜',6,'酒/饮料/蜂蜜',0,352,0,1,'','',''),(575,'龙眼蜜',6,'酒/饮料/蜂蜜',0,352,0,1,'','',''),(576,'银杏蜜',6,'酒/饮料/蜂蜜',0,352,0,1,'','',''),(577,'柑桔蜜',6,'酒/饮料/蜂蜜',0,352,0,1,'','',''),(578,'益母草蜜',6,'酒/饮料/蜂蜜',0,352,0,1,'','',''),(579,'荞麦蜜',6,'酒/饮料/蜂蜜',0,352,0,1,'','',''),(580,'五味子蜜',6,'酒/饮料/蜂蜜',0,352,0,1,'','',''),(581,'苹果蜜',6,'酒/饮料/蜂蜜',0,352,0,1,'','',''),(582,'薄荷蜜',6,'酒/饮料/蜂蜜',0,352,0,1,'','',''),(583,'百花蜜',6,'酒/饮料/蜂蜜',0,352,0,1,'','',''),(584,'荔枝蜜',6,'酒/饮料/蜂蜜',0,352,0,1,'','',''),(585,'野桂花蜜',6,'酒/饮料/蜂蜜',0,352,0,1,'','',''),(586,'野菊花蜜',6,'酒/饮料/蜂蜜',0,352,0,1,'','',''),(587,'枸杞蜜',6,'酒/饮料/蜂蜜',0,352,0,1,'','',''),(588,'枇杷蜜',6,'酒/饮料/蜂蜜',0,352,0,1,'','',''),(589,'油菜蜜',6,'酒/饮料/蜂蜜',0,352,0,1,'','',''),(590,'党参蜜',6,'酒/饮料/蜂蜜',0,352,0,1,'','',''),(591,'荆条蜜',6,'酒/饮料/蜂蜜',0,352,0,1,'','',''),(592,'枣花蜜',6,'酒/饮料/蜂蜜',0,352,0,1,'','',''),(593,'椴树蜜',6,'酒/饮料/蜂蜜',0,352,0,1,'','',''),(594,'槐花蜜',6,'酒/饮料/蜂蜜',0,352,0,1,'','',''),(595,'其它',6,'酒/饮料/蜂蜜',0,352,0,1,'','',''),(596,'林木种苗',7,'农资产品',0,353,0,1,'','',''),(597,'花卉种子',7,'农资产品',0,353,0,1,'','',''),(598,'蔬菜种子',7,'农资产品',0,353,0,1,'','',''),(599,'水果种子',7,'农资产品',0,353,0,1,'','',''),(600,'粮食种子',7,'农资产品',0,353,0,1,'','',''),(601,'经济作物种子',7,'农资产品',0,353,0,1,'','',''),(602,'除草剂',7,'农资产品',0,354,0,1,'','',''),(603,'杀菌剂',7,'农资产品',0,354,0,1,'','',''),(604,'杀虫剂',7,'农资产品',0,354,0,1,'','',''),(605,'杀螨剂',7,'农资产品',0,354,0,1,'','',''),(606,'生物农药',7,'农资产品',0,354,0,1,'','',''),(607,'植物成长调节剂',7,'农资产品',0,354,0,1,'','',''),(608,'农药原药',7,'农资产品',0,354,0,1,'','',''),(609,'其它农药',7,'农资产品',0,354,0,1,'','',''),(610,'氮肥',7,'农资产品',0,355,0,1,'','',''),(611,'磷肥',7,'农资产品',0,355,0,1,'','',''),(612,'钾肥',7,'农资产品',0,355,0,1,'','',''),(613,'复合肥',7,'农资产品',0,355,0,1,'','',''),(614,'微量元素肥',7,'农资产品',0,355,0,1,'','',''),(615,'生物肥',7,'农资产品',0,355,0,1,'','',''),(616,'叶面肥',7,'农资产品',0,355,0,1,'','',''),(617,'其它肥',7,'农资产品',0,355,0,1,'','',''),(618,'农膜',7,'农资产品',0,356,0,1,'','',''),(619,'农具',7,'农资产品',0,356,0,1,'','',''),(620,'农机',7,'农资产品',0,356,0,1,'','',''),(621,'高压聚乙烯地膜',7,'农资产品',0,618,0,1,'','',''),(622,'高压聚乙烯棚膜',7,'农资产品',0,618,0,1,'','',''),(623,'pvc农膜',7,'农资产品',0,618,0,1,'','',''),(624,'其它农膜产品',7,'农资产品',0,618,0,1,'','',''),(625,'犁耕工具',7,'农资产品',0,619,0,1,'','',''),(626,'播种工具',7,'农资产品',0,619,0,1,'','',''),(627,'除草工具',7,'农资产品',0,619,0,1,'','',''),(628,'灌溉工具',7,'农资产品',0,619,0,1,'','',''),(629,'收获工具',7,'农资产品',0,619,0,1,'','',''),(630,'加工工具',7,'农资产品',0,619,0,1,'','',''),(631,'运输工具',7,'农资产品',0,619,0,1,'','',''),(632,'其它工具',7,'农资产品',0,619,0,1,'','',''),(633,'植保机具',7,'农资产品',0,620,0,1,'','',''),(634,'收割机',7,'农资产品',0,620,0,1,'','',''),(635,'喷灌机',7,'农资产品',0,620,0,1,'','',''),(636,'包衣机',7,'农资产品',0,620,0,1,'','',''),(637,'播种机',7,'农资产品',0,620,0,1,'','',''),(638,'农机配件',7,'农资产品',0,620,0,1,'','',''),(639,'施肥机械',7,'农资产品',0,620,0,1,'','',''),(640,'排灌机械',7,'农资产品',0,620,0,1,'','',''),(641,'土壤耕整机械',7,'农资产品',0,620,0,1,'','',''),(642,'林业机械',7,'农资产品',0,620,0,1,'','',''),(643,'肥料加工设备',7,'农资产品',0,620,0,1,'','',''),(644,'其它',7,'农资产品',0,620,0,1,'','',''),(645,'棕榈仁油',8,'食用油',0,357,0,1,'','',''),(646,'棉籽油',8,'食用油',0,357,0,1,'','',''),(647,'大豆油',8,'食用油',0,357,0,1,'','',''),(648,'菜籽油',8,'食用油',0,357,0,1,'','',''),(649,'椰子油',8,'食用油',0,357,0,1,'','',''),(650,'调和油',8,'食用油',0,357,0,1,'','',''),(651,'玉米油',8,'食用油',0,357,0,1,'','',''),(652,'茶籽油',8,'食用油',0,357,0,1,'','',''),(653,'芝麻油',8,'食用油',0,357,0,1,'','',''),(654,'米糠油',8,'食用油',0,357,0,1,'','',''),(655,'蓖麻油',8,'食用油',0,357,0,1,'','',''),(656,'橄榄油',8,'食用油',0,357,0,1,'','',''),(657,'亚麻油',8,'食用油',0,357,0,1,'','',''),(658,'红花油',8,'食用油',0,357,0,1,'','',''),(659,'花生油',8,'食用油',0,357,0,1,'','',''),(660,'核桃油',8,'食用油',0,357,0,1,'','',''),(661,'葡萄籽油',8,'食用油',0,357,0,1,'','',''),(662,'南瓜籽油',8,'食用油',0,357,0,1,'','',''),(663,'色拉油',8,'食用油',0,357,0,1,'','',''),(664,'其它',8,'食用油',0,357,0,1,'','',''),(665,'猪油',8,'食用油',0,358,0,1,'','',''),(666,'羊油',8,'食用油',0,358,0,1,'','',''),(667,'牛油',8,'食用油',0,358,0,1,'','',''),(668,'其他',8,'食用油',0,358,0,1,'','',''),(669,'牛肉类',2,'休闲食品',0,359,0,1,'','',''),(670,'猪肉类',2,'休闲食品',0,359,0,1,'','',''),(671,'鸭肉类零食',2,'休闲食品',0,359,0,1,'','',''),(672,'猪肉脯',2,'休闲食品',0,359,0,1,'','',''),(673,'鸡肉类零食',2,'休闲食品',0,359,0,1,'','',''),(674,'豆干制品',2,'休闲食品',0,359,0,1,'','',''),(675,'其它',2,'休闲食品',0,359,0,1,'','',''),(676,'膨化食品',2,'休闲食品',0,360,0,1,'','',''),(677,'饼干',2,'休闲食品',0,360,0,1,'','',''),(678,'传统糕点',2,'休闲食品',0,360,0,1,'','',''),(679,'其它小点心',2,'休闲食品',0,360,0,1,'','',''),(680,'豆类制品',2,'休闲食品',0,361,0,1,'','',''),(681,'瓜子',2,'休闲食品',0,361,0,1,'','',''),(682,'花生',2,'休闲食品',0,361,0,1,'','',''),(683,'夏威夷果',2,'休闲食品',0,361,0,1,'','',''),(684,'长寿果/碧根果',2,'休闲食品',0,361,0,1,'','',''),(685,'开心果',2,'休闲食品',0,361,0,1,'','',''),(686,'核桃仁',2,'休闲食品',0,361,0,1,'','',''),(687,'杏仁/巴旦木',2,'休闲食品',0,361,0,1,'','',''),(688,'栗类制品',2,'休闲食品',0,361,0,1,'','',''),(689,'松子',2,'休闲食品',0,361,0,1,'','',''),(690,'腰果',2,'休闲食品',0,361,0,1,'','',''),(691,'其它',2,'休闲食品',0,361,0,1,'','',''),(692,'鱼系列',2,'休闲食品',0,362,0,1,'','',''),(693,'鱿鱼系列',2,'休闲食品',0,362,0,1,'','',''),(694,'海苔系列',2,'休闲食品',0,362,0,1,'','',''),(695,'虾系列',2,'休闲食品',0,362,0,1,'','',''),(696,'海带/裙菜类系列',2,'休闲食品',0,362,0,1,'','',''),(697,'贝系列',2,'休闲食品',0,362,0,1,'','',''),(698,'蟹系列',2,'休闲食品',0,362,0,1,'','',''),(699,'海参系列',2,'休闲食品',0,362,0,1,'','',''),(700,'其它系列',2,'休闲食品',0,362,0,1,'','',''),(701,'棒棒糖',2,'休闲食品',0,363,0,1,'','',''),(702,'牛轧糖',2,'休闲食品',0,363,0,1,'','',''),(703,'软糖',2,'休闲食品',0,363,0,1,'','',''),(704,'杏仁糖',2,'休闲食品',0,363,0,1,'','',''),(705,'什锦糖',2,'休闲食品',0,363,0,1,'','',''),(706,'榴莲糖',2,'休闲食品',0,363,0,1,'','',''),(707,'排糖',2,'休闲食品',0,363,0,1,'','',''),(708,'奶糖',2,'休闲食品',0,363,0,1,'','',''),(709,'水果糖',2,'休闲食品',0,363,0,1,'','',''),(710,'酥糖',2,'休闲食品',0,363,0,1,'','',''),(711,'薄荷糖',2,'休闲食品',0,363,0,1,'','',''),(712,'姜糖',2,'休闲食品',0,363,0,1,'','',''),(713,'润喉糖',2,'休闲食品',0,363,0,1,'','',''),(714,'无糖糖果',2,'休闲食品',0,363,0,1,'','',''),(715,'咖啡糖',2,'休闲食品',0,363,0,1,'','',''),(716,'太妃糖',2,'休闲食品',0,363,0,1,'','',''),(717,'麦芽糖',2,'休闲食品',0,363,0,1,'','',''),(718,'方糖',2,'休闲食品',0,363,0,1,'','',''),(719,'其它',2,'休闲食品',0,363,0,1,'','',''),(720,'梅类制品',2,'休闲食品',0,364,0,1,'','',''),(721,'枣类制品',2,'休闲食品',0,364,0,1,'','',''),(722,'山楂类制品',2,'休闲食品',0,364,0,1,'','',''),(723,'薯类制品',2,'休闲食品',0,364,0,1,'','',''),(724,'椰子片',2,'休闲食品',0,364,0,1,'','',''),(725,'蔬果干',2,'休闲食品',0,364,0,1,'','',''),(726,'无花果干',2,'休闲食品',0,364,0,1,'','',''),(727,'芒果干',2,'休闲食品',0,364,0,1,'','',''),(728,'香蕉干/片',2,'休闲食品',0,364,0,1,'','',''),(729,'圣女果干',2,'休闲食品',0,364,0,1,'','',''),(730,'橄榄其它',2,'休闲食品',0,364,0,1,'','',''),(731,'羊',3,'养殖业',0,365,0,1,'','',''),(732,'牛',3,'养殖业',0,365,0,1,'','',''),(733,'马',3,'养殖业',0,365,0,1,'','',''),(734,'猪',3,'养殖业',0,365,0,1,'','',''),(735,'驴',3,'养殖业',0,365,0,1,'','',''),(736,'骡',3,'养殖业',0,365,0,1,'','',''),(737,'羊崽',3,'养殖业',0,365,0,1,'','',''),(738,'牛崽',3,'养殖业',0,365,0,1,'','',''),(739,'马崽',3,'养殖业',0,365,0,1,'','',''),(740,'猪崽',3,'养殖业',0,365,0,1,'','',''),(741,'驴崽',3,'养殖业',0,365,0,1,'','',''),(742,'骡崽',3,'养殖业',0,365,0,1,'','',''),(743,'其它崽类',3,'养殖业',0,365,0,1,'','',''),(744,'鸡',3,'养殖业',0,366,0,1,'','',''),(745,'鸭',3,'养殖业',0,366,0,1,'','',''),(746,'鹅',3,'养殖业',0,366,0,1,'','',''),(747,'兔子',3,'养殖业',0,366,0,1,'','',''),(748,'鸽子',3,'养殖业',0,366,0,1,'','',''),(749,'其它家禽',3,'养殖业',0,366,0,1,'','',''),(750,'鸡崽',3,'养殖业',0,366,0,1,'','',''),(751,'鸭崽',3,'养殖业',0,366,0,1,'','',''),(752,'鹅苗',3,'养殖业',0,366,0,1,'','',''),(753,'兔崽',3,'养殖业',0,366,0,1,'','',''),(754,'鸽崽',3,'养殖业',0,366,0,1,'','',''),(755,'其它家禽崽类',3,'养殖业',0,366,0,1,'','',''),(756,'虾类',3,'养殖业',0,367,0,1,'','',''),(757,'鱼类',3,'养殖业',0,367,0,1,'','',''),(758,'软体类',3,'养殖业',0,367,0,1,'','',''),(759,'螃蟹类',3,'养殖业',0,367,0,1,'','',''),(760,'鱿鱼类',3,'养殖业',0,367,0,1,'','',''),(761,'贝类',3,'养殖业',0,367,0,1,'','',''),(762,'龟鳖类',3,'养殖业',0,367,0,1,'','',''),(763,'藻类',3,'养殖业',0,367,0,1,'','',''),(764,'其它',3,'养殖业',0,367,0,1,'','',''),(765,'新鲜羊肉',3,'养殖业',0,368,0,1,'','',''),(766,'新鲜牛肉',3,'养殖业',0,368,0,1,'','',''),(767,'新鲜猪肉',3,'养殖业',0,368,0,1,'','',''),(768,'新鲜驴肉',3,'养殖业',0,368,0,1,'','',''),(769,'其它新鲜牲畜肉产品',3,'养殖业',0,368,0,1,'','',''),(770,'新鲜鸡肉',3,'养殖业',0,369,0,1,'','',''),(771,'新鲜鸭肉',3,'养殖业',0,369,0,1,'','',''),(772,'新鲜鹅肉',3,'养殖业',0,369,0,1,'','',''),(773,'新鲜鸽肉',3,'养殖业',0,369,0,1,'','',''),(774,'新鲜兔肉',3,'养殖业',0,369,0,1,'','',''),(775,'其它新鲜家禽肉类',3,'养殖业',0,369,0,1,'','',''),(776,'鸡蛋',3,'养殖业',0,370,0,1,'','',''),(777,'鸭蛋',3,'养殖业',0,370,0,1,'','',''),(778,'鹅蛋',3,'养殖业',0,370,0,1,'','',''),(779,'鸽蛋',3,'养殖业',0,370,0,1,'','',''),(780,'其它新鲜蛋类',3,'养殖业',0,370,0,1,'','',''),(781,'土鸡蛋',3,'养殖业',0,370,0,1,'','',''),(782,'土鸭蛋',3,'养殖业',0,370,0,1,'','',''),(783,'土鹅蛋',3,'养殖业',0,370,0,1,'','',''),(784,'其它',3,'养殖业',0,370,0,1,'','',''),(785,'咸鸭肉',3,'养殖业',0,371,0,1,'','',''),(786,'咸鸡肉',3,'养殖业',0,371,0,1,'','',''),(787,'咸鹅肉',3,'养殖业',0,371,0,1,'','',''),(788,'其它咸肉',3,'养殖业',0,371,0,1,'','',''),(789,'咸牛肉',3,'养殖业',0,372,0,1,'','',''),(790,'咸羊肉',3,'养殖业',0,372,0,1,'','',''),(791,'咸猪肉',3,'养殖业',0,372,0,1,'','',''),(792,'其它咸肉',3,'养殖业',0,372,0,1,'','',''),(793,'咸鸡蛋',3,'养殖业',0,373,0,1,'','',''),(794,'咸鸭蛋',3,'养殖业',0,373,0,1,'','',''),(795,'咸鹅蛋',3,'养殖业',0,373,0,1,'','',''),(796,'其它咸蛋',3,'养殖业',0,373,0,1,'','',''),(797,'咸鱼',3,'养殖业',0,374,0,1,'','',''),(798,'干鱼',3,'养殖业',0,374,0,1,'','',''),(799,'干虾',3,'养殖业',0,374,0,1,'','',''),(800,'其它',3,'养殖业',0,374,0,1,'','',''),(801,'茧/蚕丝',3,'养殖业',0,375,0,1,'','',''),(802,'羽毛/羽绒',3,'养殖业',0,375,0,1,'','',''),(803,'肠衣',3,'养殖业',0,375,0,1,'','',''),(804,'生皮/毛皮',3,'养殖业',0,375,0,1,'','',''),(805,'动物毛鬃',3,'养殖业',0,375,0,1,'','',''),(806,'动物原药材',3,'养殖业',0,375,0,1,'','',''),(807,'其它畜牧业副产品',3,'养殖业',0,375,0,1,'','','');

/*Table structure for table `nc_goods_comment` */

DROP TABLE IF EXISTS `nc_goods_comment`;

CREATE TABLE `nc_goods_comment` (
  `comm_id` int(11) unsigned NOT NULL auto_increment,
  `goods_id` int(10) unsigned NOT NULL COMMENT '商品索引id',
  `g_uid` int(10) NOT NULL COMMENT '商品所属用户',
  `uid` int(10) NOT NULL COMMENT '评价人',
  `content` varchar(250) NOT NULL COMMENT '评价内容',
  `assured_score` decimal(4,2) default '0.00' COMMENT '商品放心值',
  `addtime` int(10) unsigned NOT NULL default '0',
  `updatetime` int(10) unsigned NOT NULL default '0',
  PRIMARY KEY  (`comm_id`),
  KEY `g_uid` (`g_uid`),
  KEY `uid` (`uid`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='商品评论';

/*Data for the table `nc_goods_comment` */

/*Table structure for table `nc_goods_comment_reply` */

DROP TABLE IF EXISTS `nc_goods_comment_reply`;

CREATE TABLE `nc_goods_comment_reply` (
  `id` int(11) unsigned NOT NULL auto_increment,
  `comm_id` int(11) unsigned NOT NULL COMMENT '评论id',
  `reply_uid` int(10) NOT NULL COMMENT '被回复人',
  `uid` int(10) NOT NULL COMMENT '回复人',
  `content` varchar(250) NOT NULL COMMENT '评价内容',
  `addtime` int(10) unsigned NOT NULL default '0',
  `updatetime` int(10) unsigned NOT NULL default '0',
  PRIMARY KEY  (`id`),
  KEY `comm_id` (`comm_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='商品评论回复';

/*Data for the table `nc_goods_comment_reply` */

/*Table structure for table `nc_goods_type` */

DROP TABLE IF EXISTS `nc_goods_type`;

CREATE TABLE `nc_goods_type` (
  `type_id` int(10) unsigned NOT NULL auto_increment COMMENT '类型id',
  `type_name` varchar(100) NOT NULL COMMENT '类型名称',
  `type_sort` tinyint(1) unsigned NOT NULL COMMENT '排序',
  PRIMARY KEY  (`type_id`)
) ENGINE=InnoDB AUTO_INCREMENT=9 DEFAULT CHARSET=utf8 COMMENT='商品类型表';

/*Data for the table `nc_goods_type` */

insert  into `nc_goods_type`(`type_id`,`type_name`,`type_sort`) values (1,'种植业',1),(2,'休闲食品',4),(3,'养殖业',2),(5,'加工制品',5),(6,'酒/饮料/蜂蜜',3),(7,'农资产品',1),(8,'食用油',6);

/*Table structure for table `nc_member` */

DROP TABLE IF EXISTS `nc_member`;

CREATE TABLE `nc_member` (
  `uid` int(10) unsigned NOT NULL auto_increment COMMENT '用户ID',
  `username` char(16) NOT NULL COMMENT '用户名',
  `password` char(32) NOT NULL COMMENT '密码',
  `email` char(32) NOT NULL COMMENT '用户邮箱',
  `mobile` char(15) NOT NULL COMMENT '用户手机',
  `reg_time` int(10) unsigned NOT NULL default '0' COMMENT '注册时间',
  `reg_ip` bigint(20) NOT NULL default '0' COMMENT '注册IP',
  `last_login_time` int(10) unsigned NOT NULL default '0' COMMENT '最后登录时间',
  `last_login_ip` bigint(20) NOT NULL default '0' COMMENT '最后登录IP',
  `update_time` int(10) unsigned NOT NULL default '0' COMMENT '更新时间',
  `status` tinyint(4) default '0' COMMENT '用户状态',
  PRIMARY KEY  (`uid`),
  UNIQUE KEY `username` (`username`),
  UNIQUE KEY `email` (`email`),
  KEY `status` (`status`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='用户表';

/*Data for the table `nc_member` */

/*Table structure for table `nc_member_ext` */

DROP TABLE IF EXISTS `nc_member_ext`;

CREATE TABLE `nc_member_ext` (
  `uid` int(10) unsigned NOT NULL auto_increment COMMENT '用户ID',
  `nickname` char(16) NOT NULL default '' COMMENT '昵称',
  `sex` tinyint(3) unsigned NOT NULL default '0' COMMENT '性别',
  `birthday` date NOT NULL default '0000-00-00' COMMENT '生日',
  `qq` char(10) NOT NULL default '' COMMENT 'qq号',
  `score` mediumint(8) NOT NULL default '0' COMMENT '用户积分',
  `login` int(10) unsigned NOT NULL default '0' COMMENT '登录次数',
  `reg_ip` bigint(20) NOT NULL default '0' COMMENT '注册IP',
  `reg_time` int(10) unsigned NOT NULL default '0' COMMENT '注册时间',
  `last_login_ip` bigint(20) NOT NULL default '0' COMMENT '最后登录IP',
  `last_login_time` int(10) unsigned NOT NULL default '0' COMMENT '最后登录时间',
  `status` tinyint(4) NOT NULL default '0' COMMENT '会员状态',
  `signature` text NOT NULL,
  `tox_money` int(11) NOT NULL,
  `pos_province` int(11) NOT NULL,
  `pos_city` int(11) NOT NULL,
  `pos_district` int(11) NOT NULL,
  `pos_community` int(11) NOT NULL,
  PRIMARY KEY  (`uid`),
  KEY `status` (`status`),
  KEY `name` (`nickname`)
) ENGINE=MyISAM AUTO_INCREMENT=58 DEFAULT CHARSET=utf8 COMMENT='用户扩展表';

/*Data for the table `nc_member_ext` */

/*Table structure for table `nc_store` */

DROP TABLE IF EXISTS `nc_store`;

CREATE TABLE `nc_store` (
  `store_id` int(11) NOT NULL auto_increment COMMENT '店铺索引id',
  `store_name` varchar(50) NOT NULL COMMENT '店铺名称',
  `store_auth` tinyint(1) default '0' COMMENT '店铺认证',
  `name_auth` tinyint(1) default '0' COMMENT '店主认证',
  `grade_id` int(11) NOT NULL COMMENT '店铺等级',
  `uid` int(11) NOT NULL COMMENT '会员id',
  `store_owner_card` varchar(50) default '' COMMENT '身份证',
  `gc_id` int(11) NOT NULL COMMENT '店铺分类',
  `area_id` int(11) NOT NULL COMMENT '地区id',
  `area_info` varchar(100) default '' COMMENT '地区内容，冗余数据',
  `store_address` varchar(100) NOT NULL COMMENT '详细地区',
  `store_zip` varchar(10) NOT NULL COMMENT '邮政编码',
  `store_tel` varchar(50) NOT NULL COMMENT '电话号码',
  `store_image` varchar(100) default NULL COMMENT '证件上传',
  `store_image1` varchar(100) default NULL COMMENT '执照上传',
  `store_state` tinyint(1) NOT NULL default '2' COMMENT '店铺状态，0关闭，1开启，2审核中',
  `store_close_info` varchar(255) default NULL COMMENT '店铺关闭原因',
  `store_sort` int(11) NOT NULL default '0' COMMENT '店铺排序',
  `store_end_time` varchar(10) default NULL COMMENT '店铺关闭时间',
  `store_label` varchar(255) default NULL COMMENT '店铺logo',
  `store_banner` varchar(255) default NULL COMMENT '店铺横幅',
  `store_logo` varchar(255) default NULL COMMENT '店标',
  `store_keywords` varchar(255) NOT NULL default '' COMMENT '店铺seo关键字',
  `store_description` varchar(255) NOT NULL default '' COMMENT '店铺seo描述',
  `store_qq` varchar(50) default NULL COMMENT 'QQ',
  `store_ww` varchar(50) default NULL COMMENT '阿里旺旺',
  `description` text COMMENT '店铺简介',
  `store_zy` text COMMENT '主营商品',
  `store_domain` varchar(50) default NULL COMMENT '店铺二级域名',
  `store_domain_times` tinyint(1) unsigned default '0' COMMENT '二级域名修改次数',
  `store_recommend` tinyint(1) NOT NULL default '0' COMMENT '推荐，0为否，1为是，默认为0',
  `store_theme` varchar(50) NOT NULL default 'default' COMMENT '店铺当前主题',
  `store_credit` int(10) NOT NULL default '0' COMMENT '店铺信用',
  `praise_rate` float NOT NULL default '0' COMMENT '店铺好评率',
  `store_desccredit` float NOT NULL default '0' COMMENT '描述相符度分数',
  `store_servicecredit` float NOT NULL default '0' COMMENT '服务态度分数',
  `store_deliverycredit` float NOT NULL default '0' COMMENT '发货速度分数',
  `store_code` varchar(255) NOT NULL default 'default_qrcode.png' COMMENT '店铺二维码',
  `store_collect` int(10) unsigned NOT NULL default '0' COMMENT '店铺收藏数量',
  `store_stamp` varchar(200) default NULL COMMENT '店铺印章',
  `store_printdesc` varchar(500) default NULL COMMENT '打印订单页面下方说明文字',
  `store_sales` int(10) unsigned NOT NULL default '0' COMMENT '店铺销量',
  `store_presales` text COMMENT '售前客服',
  `store_aftersales` text COMMENT '售后客服',
  `store_workingtime` varchar(100) default NULL COMMENT '工作时间',
  `createtime` int(11) NOT NULL,
  `changetime` int(11) NOT NULL,
  PRIMARY KEY  (`store_id`),
  KEY `store_name` (`store_name`),
  KEY `area_id` (`area_id`),
  KEY `store_state` (`store_state`),
  KEY `gc_id` (`gc_id`)
) ENGINE=InnoDB AUTO_INCREMENT=2 DEFAULT CHARSET=utf8 COMMENT='店铺数据表';

/*Data for the table `nc_store` */

insert  into `nc_store`(`store_id`,`store_name`,`store_auth`,`name_auth`,`grade_id`,`uid`,`store_owner_card`,`gc_id`,`area_id`,`area_info`,`store_address`,`store_zip`,`store_tel`,`store_image`,`store_image1`,`store_state`,`store_close_info`,`store_sort`,`store_end_time`,`store_label`,`store_banner`,`store_logo`,`store_keywords`,`store_description`,`store_qq`,`store_ww`,`description`,`store_zy`,`store_domain`,`store_domain_times`,`store_recommend`,`store_theme`,`store_credit`,`praise_rate`,`store_desccredit`,`store_servicecredit`,`store_deliverycredit`,`store_code`,`store_collect`,`store_stamp`,`store_printdesc`,`store_sales`,`store_presales`,`store_aftersales`,`store_workingtime`,`createtime`,`changetime`) values (1,'北京放心农场',0,0,0,0,'',0,0,'','北京','454491','010-1234567',NULL,NULL,2,NULL,0,NULL,NULL,NULL,'Tulips.jpg','','','12121',NULL,'匹配手机号码,只需要验证它是13 或者15开头的11位数字就行了!我自己写的:^1... 2011-07-14 求php正则表达式 从一段文本内容中提取 手机号码和固定电话 ...',NULL,NULL,0,0,'default',0,0,0,0,0,'default_qrcode.png',0,NULL,NULL,0,NULL,NULL,NULL,1423037381,1423037381);

/*Table structure for table `nc_store_message` */

DROP TABLE IF EXISTS `nc_store_message`;

CREATE TABLE `nc_store_message` (
  `id` int(11) unsigned NOT NULL auto_increment,
  `store_id` int(11) unsigned NOT NULL COMMENT '店铺',
  `uid` int(10) NOT NULL COMMENT '留言人',
  `type` tinyint(2) NOT NULL default '0' COMMENT '留言类型',
  `content` varchar(250) NOT NULL COMMENT '内容',
  `addtime` int(10) unsigned NOT NULL default '0',
  `updatetime` int(10) unsigned NOT NULL default '0',
  PRIMARY KEY  (`id`),
  KEY `store_id` (`store_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='店铺留言';

/*Data for the table `nc_store_message` */

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;
